openthread/openthread/third_party/NordicSemiconductor/nrfx/mdk/nrf52833.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>UICR</name>
      <description>User information configuration registers</description>
      <baseAddress>0x10001000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>UICR</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <dim>0xD</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>NRFFW[%s]</name>
          <description>Description collection: Reserved for Nordic firmware design</description>
          <addressOffset>0x014</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>NRFFW</name>
              <description>Reserved for Nordic firmware design</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>0xC</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>NRFHW[%s]</name>
          <description>Description collection: Reserved for Nordic hardware design</description>
          <addressOffset>0x050</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>NRFHW</name>
              <description>Reserved for Nordic hardware design</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x20</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CUSTOMER[%s]</name>
          <description>Description collection: Reserved for customer</description>
          <addressOffset>0x080</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>CUSTOMER</name>
              <description>Reserved for customer</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>PSELRESET[%s]</name>
          <description>Description collection: Mapping of the nRESET function (see POWER chapter for details)</description>
          <addressOffset>0x200</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>PIN</name>
              <description>GPIO pin number onto which nRESET is exposed</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>PORT</name>
              <description>Port number onto which nRESET is exposed</description>
              <lsb>5</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>CONNECT</name>
              <description>Connection</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disconnected</name>
                  <description>Disconnect</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Connected</name>
                  <description>Connect</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>APPROTECT</name>
          <description>Access port protection</description>
          <addressOffset>0x208</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>PALL</name>
              <description>Enable or disable access port protection.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0xFF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>0x00</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>NFCPINS</name>
          <description>Setting of pins dedicated to NFC functionality: NFC antenna or GPIO</description>
          <addressOffset>0x20C</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>PROTECT</name>
              <description>Setting of pins dedicated to NFC functionality</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Operation as GPIO pins. Same protection as normal GPIO pins</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NFC</name>
                  <description>Operation as NFC antenna pins. Configures the protection for NFC operation</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DEBUGCTRL</name>
          <description>Processor debug control</description>
          <addressOffset>0x210</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>CPUNIDEN</name>
              <description>Configure CPU non-intrusive debug features</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable CPU ITM and ETM functionality (default behavior)</description>
                  <value>0xFF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable CPU ITM and ETM functionality</description>
                  <value>0x00</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPUFPBEN</name>
              <description>Configure CPU flash patch and breakpoint (FPB) unit behavior</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable CPU FPB unit (default behavior)</description>
                  <value>0xFF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable CPU FPB unit. Writes into the FPB registers will be ignored.</description>
                  <value>0x00</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>REGOUT0</name>
          <description>Output voltage from REG0 regulator stage. The maximum output voltage from this stage is given as VDDH - VREG0DROP.</description>
          <addressOffset>0x304</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>VOUT</name>
              <description>Output voltage from REG0 regulator stage.</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1V8</name>
                  <description>1.8 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2V1</name>
                  <description>2.1 V</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2V4</name>
                  <description>2.4 V</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2V7</name>
                  <description>2.7 V</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3V0</name>
                  <description>3.0 V</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3V3</name>
                  <description>3.3 V</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Default voltage: 1.8 V</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
