openthread/openthread/third_party/NordicSemiconductor/nrfx/mdk/nrf52833.svd
        <register>
          <name>INTENCLR</name>
          <description>Disable interrupt</description>
          <addressOffset>0x308</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>HFCLKSTARTED</name>
              <description>Write '1' to disable interrupt for event HFCLKSTARTED</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LFCLKSTARTED</name>
              <description>Write '1' to disable interrupt for event LFCLKSTARTED</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DONE</name>
              <description>Write '1' to disable interrupt for event DONE</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTTO</name>
              <description>Write '1' to disable interrupt for event CTTO</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTSTARTED</name>
              <description>Write '1' to disable interrupt for event CTSTARTED</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTSTOPPED</name>
              <description>Write '1' to disable interrupt for event CTSTOPPED</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HFCLKRUN</name>
          <description>Status indicating that HFCLKSTART task has been triggered</description>
          <addressOffset>0x408</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>STATUS</name>
              <description>HFCLKSTART task triggered or not</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotTriggered</name>
                  <description>Task not triggered</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Triggered</name>
                  <description>Task triggered</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HFCLKSTAT</name>
          <description>HFCLK status</description>
          <addressOffset>0x40C</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>SRC</name>
              <description>Source of HFCLK</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RC</name>
                  <description>64 MHz internal oscillator (HFINT)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Xtal</name>
                  <description>64 MHz crystal oscillator (HFXO)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATE</name>
              <description>HFCLK state</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotRunning</name>
                  <description>HFCLK not running</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Running</name>
                  <description>HFCLK running</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LFCLKRUN</name>
          <description>Status indicating that LFCLKSTART task has been triggered</description>
          <addressOffset>0x414</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>STATUS</name>
              <description>LFCLKSTART task triggered or not</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotTriggered</name>
                  <description>Task not triggered</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Triggered</name>
                  <description>Task triggered</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LFCLKSTAT</name>
          <description>LFCLK status</description>
          <addressOffset>0x418</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>SRC</name>
              <description>Source of LFCLK</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RC</name>
                  <description>32.768 kHz RC oscillator (LFRC)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Xtal</name>
                  <description>32.768 kHz crystal oscillator (LFXO)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Synth</name>
                  <description>32.768 kHz synthesized from HFCLK (LFSYNT)</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATE</name>
              <description>LFCLK state</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotRunning</name>
                  <description>LFCLK not running</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Running</name>
                  <description>LFCLK running</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LFCLKSRCCOPY</name>
          <description>Copy of LFCLKSRC register, set when LFCLKSTART task was triggered</description>
          <addressOffset>0x41C</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>SRC</name>
              <description>Clock source</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RC</name>
                  <description>32.768 kHz RC oscillator (LFRC)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Xtal</name>
                  <description>32.768 kHz crystal oscillator (LFXO)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Synth</name>
                  <description>32.768 kHz synthesized from HFCLK (LFSYNT)</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LFCLKSRC</name>
          <description>Clock source for the LFCLK</description>
          <addressOffset>0x518</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>SRC</name>
              <description>Clock source</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RC</name>
                  <description>32.768 kHz RC oscillator (LFRC)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Xtal</name>
                  <description>32.768 kHz crystal oscillator (LFXO)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Synth</name>
                  <description>32.768 kHz synthesized from HFCLK (LFSYNT)</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BYPASS</name>
              <description>Enable or disable bypass of LFCLK crystal oscillator with external clock source</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable (use with Xtal or low-swing external source)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable (use with rail-to-rail external source)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTERNAL</name>
              <description>Enable or disable external source for LFCLK</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable external source (use with Xtal)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable use of external source instead of Xtal (SRC needs to be set to Xtal)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HFXODEBOUNCE</name>
          <description>HFXO debounce time. The HFXO is started by triggering the TASKS_HFCLKSTART task.</description>
          <addressOffset>0x528</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>HFXODEBOUNCE</name>
              <description>HFXO debounce time. Debounce time = HFXODEBOUNCE * 16 us.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Db256us</name>
                  <description>256 us debounce time. Recommended for TSX-3225, FA-20H and FA-128 crystals.</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Db1024us</name>
                  <description>1024 us debounce time. Recommended for NX1612AA and NX1210AB crystals.</description>
                  <value>0x40</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LFXODEBOUNCE</name>
          <description>LFXO debounce time. The LFXO is started by triggering the TASKS_LFCLKSTART task when the LFCLKSRC register is configured for Xtal.</description>
          <addressOffset>0x52C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LFXODEBOUNCE</name>
              <description>LFXO debounce time.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Normal</name>
                  <description>8192 32.768 kHz periods, or 0.25 s. Recommended for normal Operating Temperature conditions.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Extended</name>
                  <description>16384 32.768 kHz periods, or 0.5 s. Recommended for Extended Operating Temperature conditions.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTIV</name>
          <description>Calibration timer interval</description>
          <addressOffset>0x538</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CTIV</name>
              <description>Calibration timer interval in multiple of 0.25 seconds. Range: 0.25 seconds to 31.75 seconds.</description>
              <lsb>0</lsb>
              <msb>6</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TRACECONFIG</name>
          <description>Clocking options for the trace port debug interface</description>
          <addressOffset>0x55C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TRACEPORTSPEED</name>
              <description>Speed of trace port clock. Note that the TRACECLK pin will output this clock divided by two.</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>32MHz</name>
                  <description>32 MHz trace port clock (TRACECLK = 16 MHz)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16MHz</name>
                  <description>16 MHz trace port clock (TRACECLK = 8 MHz)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8MHz</name>
                  <description>8 MHz trace port clock (TRACECLK = 4 MHz)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4MHz</name>
                  <description>4 MHz trace port clock (TRACECLK = 2 MHz)</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRACEMUX</name>
              <description>Pin multiplexing of trace signals. See pin assignment chapter for more details.</description>
              <lsb>16</lsb>
              <msb>17</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO</name>
                  <description>No trace signals routed to pins. All pins can be used as regular GPIOs.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Serial</name>
                  <description>SWO trace signal routed to pin. Remaining pins can be used as regular GPIOs.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Parallel</name>
                  <description>All trace signals (TRACECLK and TRACEDATA[n]) routed to pins.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
