openthread/openthread/third_party/NordicSemiconductor/nrfx/mdk/nrf52833.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>RNG</name>
      <description>Random Number Generator</description>
      <baseAddress>0x4000D000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>RNG</name>
        <value>13</value>
      </interrupt>
      <groupName>RNG</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>TASKS_START</name>
          <description>Task starting the random number generator</description>
          <addressOffset>0x000</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_START</name>
              <description>Task starting the random number generator</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_STOP</name>
          <description>Task stopping the random number generator</description>
          <addressOffset>0x004</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_STOP</name>
              <description>Task stopping the random number generator</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_VALRDY</name>
          <description>Event being generated for every new random number written to the VALUE register</description>
          <addressOffset>0x100</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_VALRDY</name>
              <description>Event being generated for every new random number written to the VALUE register</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SHORTS</name>
          <description>Shortcuts between local events and tasks</description>
          <addressOffset>0x200</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>VALRDY_STOP</name>
              <description>Shortcut between event VALRDY and task STOP</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable shortcut</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable shortcut</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENSET</name>
          <description>Enable interrupt</description>
          <addressOffset>0x304</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>VALRDY</name>
              <description>Write '1' to enable interrupt for event VALRDY</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENCLR</name>
          <description>Disable interrupt</description>
          <addressOffset>0x308</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>VALRDY</name>
              <description>Write '1' to disable interrupt for event VALRDY</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG</name>
          <description>Configuration register</description>
          <addressOffset>0x504</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>DERCEN</name>
              <description>Bias correction</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>VALUE</name>
          <description>Output random number</description>
          <addressOffset>0x508</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Generated random number</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
