openthread/openthread/third_party/NordicSemiconductor/nrfx/mdk/nrf52833.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SWI0</name>
      <description>Software interrupt 0</description>
      <baseAddress>0x40014000</baseAddress>
      <alternatePeripheral>EGU0</alternatePeripheral>
      <headerStructName>SWI</headerStructName>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SWI0_EGU0</name>
        <value>20</value>
      </interrupt>
      <groupName>SWI</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>UNUSED</name>
          <description>Unused.</description>
          <addressOffset>0x000</addressOffset>
          <resetValue>0x00000000</resetValue>
          <access>read-only</access>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="EGU0">
      <name>EGU1</name>
      <description>Event Generator Unit 1</description>
      <baseAddress>0x40015000</baseAddress>
      <interrupt>
        <name>SWI1_EGU1</name>
        <value>21</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SWI0">
      <name>SWI1</name>
      <description>Software interrupt 1</description>
      <baseAddress>0x40015000</baseAddress>
      <alternatePeripheral>EGU1</alternatePeripheral>
      <interrupt>
        <name>SWI1_EGU1</name>
        <value>21</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="EGU0">
      <name>EGU2</name>
      <description>Event Generator Unit 2</description>
      <baseAddress>0x40016000</baseAddress>
      <interrupt>
        <name>SWI2_EGU2</name>
        <value>22</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SWI0">
      <name>SWI2</name>
      <description>Software interrupt 2</description>
      <baseAddress>0x40016000</baseAddress>
      <alternatePeripheral>EGU2</alternatePeripheral>
      <interrupt>
        <name>SWI2_EGU2</name>
        <value>22</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="EGU0">
      <name>EGU3</name>
      <description>Event Generator Unit 3</description>
      <baseAddress>0x40017000</baseAddress>
      <interrupt>
        <name>SWI3_EGU3</name>
        <value>23</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SWI0">
      <name>SWI3</name>
      <description>Software interrupt 3</description>
      <baseAddress>0x40017000</baseAddress>
      <alternatePeripheral>EGU3</alternatePeripheral>
      <interrupt>
        <name>SWI3_EGU3</name>
        <value>23</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="EGU0">
      <name>EGU4</name>
      <description>Event Generator Unit 4</description>
      <baseAddress>0x40018000</baseAddress>
      <interrupt>
        <name>SWI4_EGU4</name>
        <value>24</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SWI0">
      <name>SWI4</name>
      <description>Software interrupt 4</description>
      <baseAddress>0x40018000</baseAddress>
      <alternatePeripheral>EGU4</alternatePeripheral>
      <interrupt>
        <name>SWI4_EGU4</name>
        <value>24</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="EGU0">
      <name>EGU5</name>
      <description>Event Generator Unit 5</description>
      <baseAddress>0x40019000</baseAddress>
      <interrupt>
        <name>SWI5_EGU5</name>
        <value>25</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SWI0">
      <name>SWI5</name>
      <description>Software interrupt 5</description>
      <baseAddress>0x40019000</baseAddress>
      <alternatePeripheral>EGU5</alternatePeripheral>
      <interrupt>
        <name>SWI5_EGU5</name>
        <value>25</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="TIMER0">
      <name>TIMER3</name>
      <description>Timer/Counter 3</description>
      <baseAddress>0x4001A000</baseAddress>
      <interrupt>
        <name>TIMER3</name>
        <value>26</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="TIMER0">
      <name>TIMER4</name>
      <description>Timer/Counter 4</description>
      <baseAddress>0x4001B000</baseAddress>
      <interrupt>
        <name>TIMER4</name>
        <value>27</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>PWM0</name>
      <description>Pulse width modulation unit 0</description>
      <baseAddress>0x4001C000</baseAddress>
      <headerStructName>PWM</headerStructName>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>PWM0</name>
        <value>28</value>
      </interrupt>
      <groupName>PWM</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>TASKS_STOP</name>
          <description>Stops PWM pulse generation on all channels at the end of current PWM period, and stops sequence playback</description>
          <addressOffset>0x004</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_STOP</name>
              <description>Stops PWM pulse generation on all channels at the end of current PWM period, and stops sequence playback</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>TASKS_SEQSTART[%s]</name>
          <description>Description collection: Loads the first PWM value on all enabled channels from sequence n, and starts playing that sequence at the rate defined in SEQ[n]REFRESH and/or DECODER.MODE. Causes PWM generation to start if not running.</description>
          <addressOffset>0x008</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_SEQSTART</name>
              <description>Loads the first PWM value on all enabled channels from sequence n, and starts playing that sequence at the rate defined in SEQ[n]REFRESH and/or DECODER.MODE. Causes PWM generation to start if not running.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_NEXTSTEP</name>
          <description>Steps by one value in the current sequence on all enabled channels if DECODER.MODE=NextStep. Does not cause PWM generation to start if not running.</description>
          <addressOffset>0x010</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_NEXTSTEP</name>
              <description>Steps by one value in the current sequence on all enabled channels if DECODER.MODE=NextStep. Does not cause PWM generation to start if not running.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_STOPPED</name>
          <description>Response to STOP task, emitted when PWM pulses are no longer generated</description>
          <addressOffset>0x104</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_STOPPED</name>
              <description>Response to STOP task, emitted when PWM pulses are no longer generated</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>EVENTS_SEQSTARTED[%s]</name>
          <description>Description collection: First PWM period started on sequence n</description>
          <addressOffset>0x108</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_SEQSTARTED</name>
              <description>First PWM period started on sequence n</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>EVENTS_SEQEND[%s]</name>
          <description>Description collection: Emitted at end of every sequence n, when last value from RAM has been applied to wave counter</description>
          <addressOffset>0x110</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_SEQEND</name>
              <description>Emitted at end of every sequence n, when last value from RAM has been applied to wave counter</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_PWMPERIODEND</name>
          <description>Emitted at the end of each PWM period</description>
          <addressOffset>0x118</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_PWMPERIODEND</name>
              <description>Emitted at the end of each PWM period</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_LOOPSDONE</name>
          <description>Concatenated sequences have been played the amount of times defined in LOOP.CNT</description>
          <addressOffset>0x11C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_LOOPSDONE</name>
              <description>Concatenated sequences have been played the amount of times defined in LOOP.CNT</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SHORTS</name>
          <description>Shortcuts between local events and tasks</description>
          <addressOffset>0x200</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>SEQEND0_STOP</name>
              <description>Shortcut between event SEQEND[0] and task STOP</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable shortcut</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable shortcut</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQEND1_STOP</name>
              <description>Shortcut between event SEQEND[1] and task STOP</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable shortcut</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable shortcut</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOOPSDONE_SEQSTART0</name>
              <description>Shortcut between event LOOPSDONE and task SEQSTART[0]</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable shortcut</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable shortcut</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOOPSDONE_SEQSTART1</name>
              <description>Shortcut between event LOOPSDONE and task SEQSTART[1]</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable shortcut</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable shortcut</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOOPSDONE_STOP</name>
              <description>Shortcut between event LOOPSDONE and task STOP</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable shortcut</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable shortcut</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTEN</name>
          <description>Enable or disable interrupt</description>
          <addressOffset>0x300</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>STOPPED</name>
              <description>Enable or disable interrupt for event STOPPED</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQSTARTED0</name>
              <description>Enable or disable interrupt for event SEQSTARTED[0]</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQSTARTED1</name>
              <description>Enable or disable interrupt for event SEQSTARTED[1]</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQEND0</name>
              <description>Enable or disable interrupt for event SEQEND[0]</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQEND1</name>
              <description>Enable or disable interrupt for event SEQEND[1]</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWMPERIODEND</name>
              <description>Enable or disable interrupt for event PWMPERIODEND</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOOPSDONE</name>
              <description>Enable or disable interrupt for event LOOPSDONE</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
