openthread/openthread/third_party/NordicSemiconductor/nrfx/mdk/nrf52833.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ACL</name>
      <description>Access control lists</description>
      <baseAddress>0x4001E000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>ACL</groupName>
      <size>0x20</size>
      <registers>
        <cluster>
          <dim>8</dim>
          <dimIncrement>0x010</dimIncrement>
          <name>ACL[%s]</name>
          <description>Unspecified</description>
          <headerStructName>ACL_ACL</headerStructName>
          <access>read-write</access>
          <addressOffset>0x800</addressOffset>
          <register>
            <name>ADDR</name>
            <description>Description cluster: Configure the word-aligned start address of region n to protect</description>
            <addressOffset>0x000</addressOffset>
            <access>read-writeonce</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>ADDR</name>
                <description>Valid word-aligned start address of region n to protect. Address must point to a flash page boundary.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SIZE</name>
            <description>Description cluster: Size of region to protect counting from address ACL[n].ADDR. Write '0' as no effect.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-writeonce</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>SIZE</name>
                <description>Size of flash region n in bytes. Must be a multiple of the flash page size, and the maximum region size is limited to 512 kB.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PERM</name>
            <description>Description cluster: Access permissions for region n as defined by start address ACL[n].ADDR and size ACL[n].SIZE</description>
            <addressOffset>0x008</addressOffset>
            <access>read-writeonce</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>WRITE</name>
                <description>Configure write and erase permissions for region n. Write '0' has no effect.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Allow write and erase instructions to region n</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Block write and erase instructions to region n</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>READ</name>
                <description>Configure read permissions for region n. Write '0' has no effect.</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Allow read instructions to region n</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Block read instructions to region n</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
      </registers>
    </peripheral>
    <peripheral>
      <name>NVMC</name>
      <description>Non Volatile Memory Controller</description>
      <baseAddress>0x4001E000</baseAddress>
      <alternatePeripheral>ACL</alternatePeripheral>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>NVMC</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>READY</name>
          <description>Ready flag</description>
          <addressOffset>0x400</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>READY</name>
              <description>NVMC is ready or busy</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Busy</name>
                  <description>NVMC is busy (on-going write or erase operation)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ready</name>
                  <description>NVMC is ready</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>READYNEXT</name>
          <description>Ready flag</description>
          <addressOffset>0x408</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>READYNEXT</name>
              <description>NVMC can accept a new write operation</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Busy</name>
                  <description>NVMC cannot accept any write operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ready</name>
                  <description>NVMC is ready</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG</name>
          <description>Configuration register</description>
          <addressOffset>0x504</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>WEN</name>
              <description>Program memory access mode. It is strongly recommended to only activate erase and write modes when they are actively used. Enabling write or erase will invalidate the cache and keep it invalidated.</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Ren</name>
                  <description>Read only access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Wen</name>
                  <description>Write enabled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Een</name>
                  <description>Erase enabled</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ERASEPAGE</name>
          <description>Register for erasing a page in code area</description>
          <addressOffset>0x508</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>ERASEPAGE</name>
              <description>Register for starting erase of a page in code area</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ERASEPCR1</name>
          <description>Deprecated register - Register for erasing a page in code area, equivalent to ERASEPAGE</description>
          <addressOffset>0x508</addressOffset>
          <access>write-only</access>
          <alternateRegister>ERASEPAGE</alternateRegister>
          <fields>
            <field>
              <name>ERASEPCR1</name>
              <description>Register for erasing a page in code area, equivalent to ERASEPAGE</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ERASEALL</name>
          <description>Register for erasing all non-volatile user memory</description>
          <addressOffset>0x50C</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>ERASEALL</name>
              <description>Erase all non-volatile memory including UICR registers. Note that the erase must be enabled using CONFIG.WEN before the non-volatile memory can be erased.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoOperation</name>
                  <description>No operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Erase</name>
                  <description>Start chip erase</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ERASEPCR0</name>
          <description>Deprecated register - Register for erasing a page in code area, equivalent to ERASEPAGE</description>
          <addressOffset>0x510</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>ERASEPCR0</name>
              <description>Register for starting erase of a page in code area, equivalent to ERASEPAGE</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ERASEUICR</name>
          <description>Register for erasing user information configuration registers</description>
          <addressOffset>0x514</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>ERASEUICR</name>
              <description>Register starting erase of all user information configuration registers. Note that the erase must be enabled using CONFIG.WEN before the UICR can be erased.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoOperation</name>
                  <description>No operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Erase</name>
                  <description>Start erase of UICR</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ERASEPAGEPARTIAL</name>
          <description>Register for partial erase of a page in code area</description>
          <addressOffset>0x518</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>ERASEPAGEPARTIAL</name>
              <description>Register for starting partial erase of a page in code area</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ERASEPAGEPARTIALCFG</name>
          <description>Register for partial erase configuration</description>
          <addressOffset>0x51C</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000000A</resetValue>
          <fields>
            <field>
              <name>DURATION</name>
              <description>Duration of the partial erase in milliseconds</description>
              <lsb>0</lsb>
              <msb>6</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ICACHECNF</name>
          <description>I-code cache configuration register</description>
          <addressOffset>0x540</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CACHEEN</name>
              <description>Cache enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable cache. Invalidates all cache entries.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable cache</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CACHEPROFEN</name>
              <description>Cache profiling enable</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable cache profiling</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable cache profiling</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IHIT</name>
          <description>I-code cache hit counter</description>
          <addressOffset>0x548</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>HITS</name>
              <description>Number of cache hits</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>IMISS</name>
          <description>I-code cache miss counter</description>
          <addressOffset>0x54C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>MISSES</name>
              <description>Number of cache misses</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
