openthread/openthread/third_party/NordicSemiconductor/nrfx/mdk/nrf52833.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>MWU</name>
      <description>Memory Watch Unit</description>
      <baseAddress>0x40020000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>MWU</name>
        <value>32</value>
      </interrupt>
      <groupName>MWU</groupName>
      <size>0x20</size>
      <registers>
        <cluster>
          <dim>4</dim>
          <dimIncrement>0x008</dimIncrement>
          <name>EVENTS_REGION[%s]</name>
          <description>Peripheral events.</description>
          <headerStructName>MWU_EVENTS_REGION</headerStructName>
          <access>read-write</access>
          <addressOffset>0x100</addressOffset>
          <register>
            <name>WA</name>
            <description>Description cluster: Write access to region n detected</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>WA</name>
                <description>Write access to region n detected</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotGenerated</name>
                    <description>Event not generated</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Generated</name>
                    <description>Event generated</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RA</name>
            <description>Description cluster: Read access to region n detected</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>RA</name>
                <description>Read access to region n detected</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotGenerated</name>
                    <description>Event not generated</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Generated</name>
                    <description>Event generated</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>2</dim>
          <dimIncrement>0x008</dimIncrement>
          <name>EVENTS_PREGION[%s]</name>
          <description>Peripheral events.</description>
          <headerStructName>MWU_EVENTS_PREGION</headerStructName>
          <access>read-write</access>
          <addressOffset>0x160</addressOffset>
          <register>
            <name>WA</name>
            <description>Description cluster: Write access to peripheral region n detected</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>WA</name>
                <description>Write access to peripheral region n detected</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotGenerated</name>
                    <description>Event not generated</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Generated</name>
                    <description>Event generated</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RA</name>
            <description>Description cluster: Read access to peripheral region n detected</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>RA</name>
                <description>Read access to peripheral region n detected</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotGenerated</name>
                    <description>Event not generated</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Generated</name>
                    <description>Event generated</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>INTEN</name>
          <description>Enable or disable interrupt</description>
          <addressOffset>0x300</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>REGION0WA</name>
              <description>Enable or disable interrupt for event REGION0WA</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REGION0RA</name>
              <description>Enable or disable interrupt for event REGION0RA</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REGION1WA</name>
              <description>Enable or disable interrupt for event REGION1WA</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REGION1RA</name>
              <description>Enable or disable interrupt for event REGION1RA</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REGION2WA</name>
              <description>Enable or disable interrupt for event REGION2WA</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REGION2RA</name>
              <description>Enable or disable interrupt for event REGION2RA</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REGION3WA</name>
              <description>Enable or disable interrupt for event REGION3WA</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REGION3RA</name>
              <description>Enable or disable interrupt for event REGION3RA</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PREGION0WA</name>
              <description>Enable or disable interrupt for event PREGION0WA</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PREGION0RA</name>
              <description>Enable or disable interrupt for event PREGION0RA</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PREGION1WA</name>
              <description>Enable or disable interrupt for event PREGION1WA</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PREGION1RA</name>
              <description>Enable or disable interrupt for event PREGION1RA</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
