openthread/openthread/third_party/NordicSemiconductor/nrfx/mdk/nrf52833.svd
        <register>
          <name>EPDATASTATUS</name>
          <description>Provides information on which endpoint(s) an acknowledged data transfer has occurred (EPDATA event)</description>
          <addressOffset>0x46C</addressOffset>
          <access>read-write</access>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>EPIN1</name>
              <description>Acknowledged data transfer on this IN endpoint. Write '1' to clear.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotDone</name>
                  <description>No acknowledged data transfer on this endpoint</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DataDone</name>
                  <description>Acknowledged data transfer on this endpoint has occurred</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPIN2</name>
              <description>Acknowledged data transfer on this IN endpoint. Write '1' to clear.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotDone</name>
                  <description>No acknowledged data transfer on this endpoint</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DataDone</name>
                  <description>Acknowledged data transfer on this endpoint has occurred</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPIN3</name>
              <description>Acknowledged data transfer on this IN endpoint. Write '1' to clear.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotDone</name>
                  <description>No acknowledged data transfer on this endpoint</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DataDone</name>
                  <description>Acknowledged data transfer on this endpoint has occurred</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPIN4</name>
              <description>Acknowledged data transfer on this IN endpoint. Write '1' to clear.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotDone</name>
                  <description>No acknowledged data transfer on this endpoint</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DataDone</name>
                  <description>Acknowledged data transfer on this endpoint has occurred</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPIN5</name>
              <description>Acknowledged data transfer on this IN endpoint. Write '1' to clear.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotDone</name>
                  <description>No acknowledged data transfer on this endpoint</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DataDone</name>
                  <description>Acknowledged data transfer on this endpoint has occurred</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPIN6</name>
              <description>Acknowledged data transfer on this IN endpoint. Write '1' to clear.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotDone</name>
                  <description>No acknowledged data transfer on this endpoint</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DataDone</name>
                  <description>Acknowledged data transfer on this endpoint has occurred</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPIN7</name>
              <description>Acknowledged data transfer on this IN endpoint. Write '1' to clear.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotDone</name>
                  <description>No acknowledged data transfer on this endpoint</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DataDone</name>
                  <description>Acknowledged data transfer on this endpoint has occurred</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPOUT1</name>
              <description>Acknowledged data transfer on this OUT endpoint. Write '1' to clear.</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotStarted</name>
                  <description>No acknowledged data transfer on this endpoint</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Started</name>
                  <description>Acknowledged data transfer on this endpoint has occurred</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPOUT2</name>
              <description>Acknowledged data transfer on this OUT endpoint. Write '1' to clear.</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotStarted</name>
                  <description>No acknowledged data transfer on this endpoint</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Started</name>
                  <description>Acknowledged data transfer on this endpoint has occurred</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPOUT3</name>
              <description>Acknowledged data transfer on this OUT endpoint. Write '1' to clear.</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotStarted</name>
                  <description>No acknowledged data transfer on this endpoint</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Started</name>
                  <description>Acknowledged data transfer on this endpoint has occurred</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPOUT4</name>
              <description>Acknowledged data transfer on this OUT endpoint. Write '1' to clear.</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotStarted</name>
                  <description>No acknowledged data transfer on this endpoint</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Started</name>
                  <description>Acknowledged data transfer on this endpoint has occurred</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPOUT5</name>
              <description>Acknowledged data transfer on this OUT endpoint. Write '1' to clear.</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotStarted</name>
                  <description>No acknowledged data transfer on this endpoint</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Started</name>
                  <description>Acknowledged data transfer on this endpoint has occurred</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPOUT6</name>
              <description>Acknowledged data transfer on this OUT endpoint. Write '1' to clear.</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotStarted</name>
                  <description>No acknowledged data transfer on this endpoint</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Started</name>
                  <description>Acknowledged data transfer on this endpoint has occurred</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPOUT7</name>
              <description>Acknowledged data transfer on this OUT endpoint. Write '1' to clear.</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotStarted</name>
                  <description>No acknowledged data transfer on this endpoint</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Started</name>
                  <description>Acknowledged data transfer on this endpoint has occurred</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USBADDR</name>
          <description>Device USB address</description>
          <addressOffset>0x470</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Device USB address</description>
              <lsb>0</lsb>
              <msb>6</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>BMREQUESTTYPE</name>
          <description>SETUP data, byte 0, bmRequestType</description>
          <addressOffset>0x480</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RECIPIENT</name>
              <description>Data transfer type</description>
              <lsb>0</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Device</name>
                  <description>Device</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Interface</name>
                  <description>Interface</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Endpoint</name>
                  <description>Endpoint</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Other</name>
                  <description>Other</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TYPE</name>
              <description>Data transfer type</description>
              <lsb>5</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Standard</name>
                  <description>Standard</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Class</name>
                  <description>Class</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Vendor</name>
                  <description>Vendor</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIRECTION</name>
              <description>Data transfer direction</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HostToDevice</name>
                  <description>Host-to-device</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DeviceToHost</name>
                  <description>Device-to-host</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BREQUEST</name>
          <description>SETUP data, byte 1, bRequest</description>
          <addressOffset>0x484</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BREQUEST</name>
              <description>SETUP data, byte 1, bRequest. Values provided for standard requests only, user must implement class and vendor values.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STD_GET_STATUS</name>
                  <description>Standard request GET_STATUS</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STD_CLEAR_FEATURE</name>
                  <description>Standard request CLEAR_FEATURE</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STD_SET_FEATURE</name>
                  <description>Standard request SET_FEATURE</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STD_SET_ADDRESS</name>
                  <description>Standard request SET_ADDRESS</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STD_GET_DESCRIPTOR</name>
                  <description>Standard request GET_DESCRIPTOR</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STD_SET_DESCRIPTOR</name>
                  <description>Standard request SET_DESCRIPTOR</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STD_GET_CONFIGURATION</name>
                  <description>Standard request GET_CONFIGURATION</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STD_SET_CONFIGURATION</name>
                  <description>Standard request SET_CONFIGURATION</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STD_GET_INTERFACE</name>
                  <description>Standard request GET_INTERFACE</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STD_SET_INTERFACE</name>
                  <description>Standard request SET_INTERFACE</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STD_SYNCH_FRAME</name>
                  <description>Standard request SYNCH_FRAME</description>
                  <value>12</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WVALUEL</name>
          <description>SETUP data, byte 2, LSB of wValue</description>
          <addressOffset>0x488</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WVALUEL</name>
              <description>SETUP data, byte 2, LSB of wValue</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>WVALUEH</name>
          <description>SETUP data, byte 3, MSB of wValue</description>
          <addressOffset>0x48C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WVALUEH</name>
              <description>SETUP data, byte 3, MSB of wValue</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>WINDEXL</name>
          <description>SETUP data, byte 4, LSB of wIndex</description>
          <addressOffset>0x490</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WINDEXL</name>
              <description>SETUP data, byte 4, LSB of wIndex</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>WINDEXH</name>
          <description>SETUP data, byte 5, MSB of wIndex</description>
          <addressOffset>0x494</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WINDEXH</name>
              <description>SETUP data, byte 5, MSB of wIndex</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>WLENGTHL</name>
          <description>SETUP data, byte 6, LSB of wLength</description>
          <addressOffset>0x498</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WLENGTHL</name>
              <description>SETUP data, byte 6, LSB of wLength</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>WLENGTHH</name>
          <description>SETUP data, byte 7, MSB of wLength</description>
          <addressOffset>0x49C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WLENGTHH</name>
              <description>SETUP data, byte 7, MSB of wLength</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <cluster>
          <name>SIZE</name>
          <description>Unspecified</description>
          <headerStructName>USBD_SIZE</headerStructName>
          <access>read-write</access>
          <addressOffset>0x4A0</addressOffset>
          <register>
            <dim>0x8</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>EPOUT[%s]</name>
            <description>Description collection: Number of bytes received last in the data stage of this OUT endpoint</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SIZE</name>
                <description>Number of bytes received last in the data stage of this OUT endpoint</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ISOOUT</name>
            <description>Number of bytes received last on this ISO OUT data endpoint</description>
            <addressOffset>0x020</addressOffset>
            <access>read-only</access>
            <resetValue>0x00010000</resetValue>
            <fields>
              <field>
                <name>SIZE</name>
                <description>Number of bytes received last on this ISO OUT data endpoint</description>
                <lsb>0</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>ZERO</name>
                <description>Zero-length data packet received</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Normal</name>
                    <description>No zero-length data received, use value in SIZE</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ZeroData</name>
                    <description>Zero-length data received, ignore value in SIZE</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
