openthread/openthread/third_party/NordicSemiconductor/nrfx/mdk/nrf52833.svd
        <register>
          <name>ISOINCONFIG</name>
          <description>Controls the response of the ISO IN endpoint to an IN token when no data is ready to be sent</description>
          <addressOffset>0x530</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESPONSE</name>
              <description>Controls the response of the ISO IN endpoint to an IN token when no data is ready to be sent</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoResp</name>
                  <description>Endpoint does not respond in that case</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZeroData</name>
                  <description>Endpoint responds with a zero-length data packet in that case</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>8</dim>
          <dimIncrement>0x014</dimIncrement>
          <name>EPIN[%s]</name>
          <description>Unspecified</description>
          <headerStructName>USBD_EPIN</headerStructName>
          <access>read-write</access>
          <addressOffset>0x600</addressOffset>
          <register>
            <name>PTR</name>
            <description>Description cluster: Data pointer</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>PTR</name>
                <description>Data pointer</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MAXCNT</name>
            <description>Description cluster: Maximum number of bytes to transfer</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>MAXCNT</name>
                <description>Maximum number of bytes to transfer</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AMOUNT</name>
            <description>Description cluster: Number of bytes transferred in the last transaction</description>
            <addressOffset>0x008</addressOffset>
            <access>read-only</access>
            <fields>
              <field>
                <name>AMOUNT</name>
                <description>Number of bytes transferred in the last transaction</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>ISOIN</name>
          <description>Unspecified</description>
          <headerStructName>USBD_ISOIN</headerStructName>
          <access>read-write</access>
          <addressOffset>0x6A0</addressOffset>
          <register>
            <name>PTR</name>
            <description>Data pointer</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>PTR</name>
                <description>Data pointer</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MAXCNT</name>
            <description>Maximum number of bytes to transfer</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>MAXCNT</name>
                <description>Maximum number of bytes to transfer</description>
                <lsb>0</lsb>
                <msb>9</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AMOUNT</name>
            <description>Number of bytes transferred in the last transaction</description>
            <addressOffset>0x008</addressOffset>
            <access>read-only</access>
            <fields>
              <field>
                <name>AMOUNT</name>
                <description>Number of bytes transferred in the last transaction</description>
                <lsb>0</lsb>
                <msb>9</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>8</dim>
          <dimIncrement>0x014</dimIncrement>
          <name>EPOUT[%s]</name>
          <description>Unspecified</description>
          <headerStructName>USBD_EPOUT</headerStructName>
          <access>read-write</access>
          <addressOffset>0x700</addressOffset>
          <register>
            <name>PTR</name>
            <description>Description cluster: Data pointer</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>PTR</name>
                <description>Data pointer</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MAXCNT</name>
            <description>Description cluster: Maximum number of bytes to transfer</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>MAXCNT</name>
                <description>Maximum number of bytes to transfer</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AMOUNT</name>
            <description>Description cluster: Number of bytes transferred in the last transaction</description>
            <addressOffset>0x008</addressOffset>
            <access>read-only</access>
            <fields>
              <field>
                <name>AMOUNT</name>
                <description>Number of bytes transferred in the last transaction</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>ISOOUT</name>
          <description>Unspecified</description>
          <headerStructName>USBD_ISOOUT</headerStructName>
          <access>read-write</access>
          <addressOffset>0x7A0</addressOffset>
          <register>
            <name>PTR</name>
            <description>Data pointer</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>PTR</name>
                <description>Data pointer</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MAXCNT</name>
            <description>Maximum number of bytes to transfer</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>MAXCNT</name>
                <description>Maximum number of bytes to transfer</description>
                <lsb>0</lsb>
                <msb>9</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AMOUNT</name>
            <description>Number of bytes transferred in the last transaction</description>
            <addressOffset>0x008</addressOffset>
            <access>read-only</access>
            <fields>
              <field>
                <name>AMOUNT</name>
                <description>Number of bytes transferred in the last transaction</description>
                <lsb>0</lsb>
                <msb>9</msb>
              </field>
            </fields>
          </register>
        </cluster>
      </registers>
    </peripheral>
    <peripheral derivedFrom="UARTE0">
      <name>UARTE1</name>
      <description>UART with EasyDMA 1</description>
      <baseAddress>0x40028000</baseAddress>
      <interrupt>
        <name>UARTE1</name>
        <value>40</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="PWM0">
      <name>PWM3</name>
      <description>Pulse width modulation unit 3</description>
      <baseAddress>0x4002D000</baseAddress>
      <interrupt>
        <name>PWM3</name>
        <value>45</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SPIM0">
      <name>SPIM3</name>
      <description>Serial Peripheral Interface Master with EasyDMA 3</description>
      <baseAddress>0x4002F000</baseAddress>
      <interrupt>
        <name>SPIM3</name>
        <value>47</value>
      </interrupt>
    </peripheral>
  </peripherals>
</device>